In [26]:
import pymysql as py
import pandas as pd

In [ ]:
#pip install SQLAlchemy
#pip install mysql-connector

In [27]:
import pymysql
connection = pymysql.connect(host="localhost",user='root',password="root",database="exam")

In [6]:
# see the table with query execution

#connection = pymysql.connect(user='XXX', password='XXX', database='XXX', host='XXX')


try:
    with connection.cursor() as cursor:
        query = "SELECT * FROM `employee` where salary>70000"

        cursor.execute(query)
        cursor.fetchall()

        df1 = pd.read_sql(query, connection)
finally:
    connection.close()

In [7]:
df1

   emp_id first_name last_name   birth_day sex  salary  super_id  branch_id
0     100      David   Wallace  1967-11-17   M  250000       NaN          1
1     101        Jan  Levinson  1961-05-11   F  110000     100.0          1
2     102    Michael     Scott  1964-03-15   M   75000     100.0          2
3     106       Josh    Porter  1969-09-05   M   78000     100.0          3
4     108        Jim   Halpert  1978-10-01   M   71000     106.0          3

In [ ]:
# create Database

try:
    with connection.cursor() as cursor:
        query="CREATE DATABASE exam"
        cursor.execute(query)
        cursor.fetchall()

finally:
    connection.close()

In [ ]:
# create table


try:
    with connection.cursor() as cursor:
        query="""CREATE TABLE if not exists student(
            name varchar(20) NOT NULL,
            branch varchar(50),
            roll int not null,
            section varchar(5),
            age int
        )"""
        cursor.execute(query)
finally:
    cursor.close()

In [ ]:
# see the table in database

try:
    with connection.cursor() as cursor:
        query = "show tables"

        cursor.execute(query)
        cursor.fetchall()

        table = pd.read_sql(query, connection)
finally:
    connection.close()

In [ ]:
table

In [ ]:
# see the description of table in database exam


try:
    with connection.cursor() as cursor:
        query = "desc student"

        cursor.execute(query)
        cursor.fetchall()

        desc = pd.read_sql(query, connection)
finally:
    connection.close()
    print('success')

In [ ]:
desc

In [8]:
# create dataframe

userVitals = {"UserId":["xxxxx", "yyyyy", "zzzzz", "aaaaa", "bbbbb", "ccccc", "ddddd"],

            "UserFavourite":["Greek Salad", "Philly Cheese Steak", "Turkey Burger", "Crispy Orange Chicken", "Atlantic Salmon", "Pot roast", "Banana split"],

            "MonthlyOrderFrequency":[5, 1, 2, 2, 7, 6, 1],

            "HighestOrderAmount":[30, 20, 16, 23, 20, 26, 9],

            "LastOrderAmount":[21,20,4,11,7,7,7],

            "LastOrderRating":[3,3,3,2,3,2,4],

            "AverageOrderRating":[3,4,2,1,3,4,3],

            "OrderMode":["Web", "App", "App", "App", "Web", "Web", "App"],

            "InMedicalCare":["No", "No", "No", "No", "Yes", "No", "No"]}

data   = pd.DataFrame(data=userVitals)
tableName   = "UserVitals"
data

,UserId,UserFavourite,MonthlyOrderFrequency,HighestOrderAmount,LastOrderAmount,LastOrderRating,AverageOrderRating,OrderMode,InMedicalCare
0,xxxxx,Greek Salad,5,30,21,3,3,Web,No
1,yyyyy,Philly Cheese Steak,1,20,20,3,4,App,No
2,zzzzz,Turkey Burger,2,16,4,3,2,App,No
3,aaaaa,Crispy Orange Chicken,2,23,11,2,1,App,No
4,bbbbb,Atlantic Salmon,7,20,7,3,3,Web,Yes
5,ccccc,Pot roast,6,26,7,2,4,Web,No
6,ddddd,Banana split,1,9,7,4,3,App,No

In [13]:
# working code
import mysql
import pymysql as py
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://{}:{}@localhost/exam?charset=utf8mb4".format('root','root'))
conn=engine.connect()
data.to_sql(name="uservit",con=conn,if_exists='fail',index=False)

# engine = create_engine("mysql://root:root@localhost/exam")
# data.to_sql(name="uservitals",con=engine,if_exists='fail',index=False)

+ createEngine
    + `engine = create_engine("mysql+pymysql://{}:{}@localhost/exam?charset=utf8mb4".format('root','root'))`
    + engine = create_engine("mysql+pymysql://{}:{}@localhost/exam".format('root','root'))

In [12]:
# it working

import mysql
from sqlalchemy import create_engine
import pymysql

# engine = create_engine('mysql+pymysql://root:root@localhost/exam')


# data.to_sql(naem='uservitals', con = engine)


# Import dataframe into MySQL
import sqlalchemy
database_username = 'root'
database_password = 'root'
database_ip       = '127.0.0.1'
database_name     = 'exam'
database_connection = sqlalchemy.create_engine('mysql+pymysql://{0}:{1}@{2}/{3}'.
                                               format(database_username, database_password, 
                                                      database_ip, database_name))
conn = database_connection.connect()
data.to_sql(con=conn, name='uservitals', if_exists='fail',index=False)

In [15]:

# # Import dataframe into MySQL
# import mysqlconnector
# import sqlalchemy
# database_username = 'root'
# database_password = 'root'
# database_ip       = 'localhost'
# database_name     = 'exam'
# database_connection = sqlalchemy.create_engine('mysql+mysqlconnector://{0}:`{1}`@{2}/{3}'.
#                                                format(database_username, database_password, 
#                                                       database_ip, database_name))
# data.to_sql(con=database_connection, name='uservitals', if_exists='replace')

In [ ]:
# execute quey

In [28]:
# # Add Primary key
# query = """ALTER TABLE uservit
#     ADD PRIMARY KEY (UserID)"""   # operation value error used without key length

# try:
#     with connection.cursor() as cursor:
#         cursor.execute(query)
# finally:
#     cursor.close()

In [ ]:
# ADD Primary Key
query = """ALTER TABLE Orders
ADD FOREIGN KEY (PersonID) REFERENCES Persons(PersonID);"""
# create table


try:
    with connection.cursor() as cursor:

        cursor.execute(query)
finally:
    cursor.close()

In [1]:
# create table and append data to it
# Import pandas
import pandas as pd

# Create dataframe
book_df = pd.DataFrame({
    'book_id':[12345, 12346, 12347,13456,12367],
    'title':['Python Programming', 'Learn MySQL', 'Data Science Cookbook',"Eat that frog","My dreams"],
    'price':[29, 23, 27,34,50]
})

book_df

   book_id                  title  price
0    12345     Python Programming     29
1    12346            Learn MySQL     23
2    12347  Data Science Cookbook     27
3    13456          Eat that frog     34
4    12367              My dreams     50

In [22]:
# create table book

book = """CREATE TABLE IF NOT EXISTS book(book_id int not null PRIMARY KEY,title varchar(45),price int);"""

try:
    with connection.cursor() as cursor:
        cursor.execute(book)

finally:
    cursor.close()

In [28]:
desc = "desc book"
show = 'select * from uservit'

df1 = pd.read_sql(desc, connection)

df1

     Field         Type Null  Key Default Extra
0  book_id          int   NO  PRI    None
1    title  varchar(45)  YES         None
2    price          int  YES         None

In [3]:
# creating column list for insertion
cols = "`,`".join([str(i) for i in book_df.columns.tolist()])
cols

'book_id`,`title`,`price'

In [52]:
# insert into table book


# Insert DataFrame recrds one by one.
try:
    with connection.cursor() as cursor:
        for i,row in book_df.iterrows():
            sql = "INSERT INTO `book` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
            cursor.execute(sql, tuple(row))
            cursor.commit()
            

    # the connection is not autocommitted by default, so we must commit to save our changes
finally:
    cursor.close()

IntegrityError: (1062, "Duplicate entry '12345' for key 'book.PRIMARY'")

In [51]:
show = 'select * from book'

df1 = pd.read_sql(show, connection)

In [32]:
df1

   book_id                  title  price
0    12345     Python Programming     29
1    12346            Learn MySQL     23
2    12347  Data Science Cookbook     27
3    12367              My dreams     50
4    13456          Eat that frog     34

(12367, 'My dreams', 50)

In [4]:
for i,row in book_df.iterrows():
    sql = "INSERT INTO `book` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    print(sql)

INSERT INTO `book` (`book_id`,`title`,`price`) VALUES (%s,%s,%s)
INSERT INTO `book` (`book_id`,`title`,`price`) VALUES (%s,%s,%s)
INSERT INTO `book` (`book_id`,`title`,`price`) VALUES (%s,%s,%s)
INSERT INTO `book` (`book_id`,`title`,`price`) VALUES (%s,%s,%s)
INSERT INTO `book` (`book_id`,`title`,`price`) VALUES (%s,%s,%s)

In [6]:
"INSERT INTO `book` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"

'INSERT INTO `book` (`book_id`,`title`,`price`) VALUES (%s,%s,%s)'

'INSERT INTO `book` (`'

In [24]:
avi="avinash"

"(`" +cols +"`)"

'(`book_id`,`title`,`price`)'

In [29]:
# create table and append data into table from dataframe

# create table book

book = """CREATE TABLE IF NOT EXISTS books(book_id int not null PRIMARY KEY,title varchar(45),price int);"""

try:
    with connection.cursor() as cursor:
        cursor.execute(book)

finally:
    cursor.close()

In [30]:
# see desc of table books
desc_book= pd.read_sql("desc books",connection)

In [31]:
desc_book

     Field         Type Null  Key Default Extra
0  book_id          int   NO  PRI    None
1    title  varchar(45)  YES         None
2    price          int  YES         None

In [32]:
# working code  append data into existing table
import mysql
import pymysql as py
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://{}:{}@localhost/exam?charset=utf8mb4".format('root','root'))
conn=engine.connect()
book_df.to_sql(name="books",con=conn,if_exists='append',index=False)

# engine = create_engine("mysql://root:root@localhost/exam")
# data.to_sql(name="uservitals",con=engine,if_exists='fail',index=False)

In [49]:
# see desc of table books
# see the table in database
import pymysql
connection = pymysql.connect(host="localhost",user='root',password="root",database="exam")


book_detail= pd.read_sql("select * from `book`",connection)
book_detail

Empty DataFrame
Columns: [book_id, title, price]
Index: []

In [45]:
# see the table in database
import pymysql
connection = pymysql.connect(host="localhost",user='root',password="root",database="exam")

try:
    with connection.cursor() as cursor:
        query = "select * from `books`"

        #cursor.execute(query)
        #cursor.fetchall()

        table = pd.read_sql(query, connection)
finally:
    connection.close()

In [46]:
table

   book_id                  title  price
0    12345     Python Programming     29
1    12346            Learn MySQL     23
2    12347  Data Science Cookbook     27
3    12367              My dreams     50
4    13456          Eat that frog     34